## Production: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `aws_ses_domain_dkim.custom_sending_domains[&quot;core-ocre.gc.ca&quot;]`                                     |
|        | `aws_ses_domain_dkim.custom_sending_domains[&quot;international.gc.ca&quot;]`                                 |
|        | `aws_ses_domain_identity.custom_sending_domains[&quot;core-ocre.gc.ca&quot;]`                                 |
|        | `aws_ses_domain_identity.custom_sending_domains[&quot;international.gc.ca&quot;]`                             |
|        | `aws_ses_domain_mail_from.custom_sending_domains[&quot;core-ocre.gc.ca&quot;]`                                |
|        | `aws_ses_domain_mail_from.custom_sending_domains[&quot;international.gc.ca&quot;]`                            |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic[&quot;core-ocre.gc.ca&quot;]`        |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic[&quot;international.gc.ca&quot;]`    |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic[&quot;core-ocre.gc.ca&quot;]`     |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic[&quot;international.gc.ca&quot;]` |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic[&quot;core-ocre.gc.ca&quot;]`      |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic[&quot;international.gc.ca&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ses_domain_dkim.custom_sending_domains["core-ocre.gc.ca"] will be created
  + resource "aws_ses_domain_dkim" "custom_sending_domains" {
      + dkim_tokens = (known after apply)
      + domain      = "core-ocre.gc.ca"
      + id          = (known after apply)
    }

  # aws_ses_domain_dkim.custom_sending_domains["international.gc.ca"] will be created
  + resource "aws_ses_domain_dkim" "custom_sending_domains" {
      + dkim_tokens = (known after apply)
      + domain      = "international.gc.ca"
      + id          = (known after apply)
    }

  # aws_ses_domain_identity.custom_sending_domains["core-ocre.gc.ca"] will be created
  + resource "aws_ses_domain_identity" "custom_sending_domains" {
      + arn                = (known after apply)
      + domain             = "core-ocre.gc.ca"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # aws_ses_domain_identity.custom_sending_domains["international.gc.ca"] will be created
  + resource "aws_ses_domain_identity" "custom_sending_domains" {
      + arn                = (known after apply)
      + domain             = "international.gc.ca"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # aws_ses_domain_mail_from.custom_sending_domains["core-ocre.gc.ca"] will be created
  + resource "aws_ses_domain_mail_from" "custom_sending_domains" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "core-ocre.gc.ca"
      + id                     = (known after apply)
      + mail_from_domain       = "bounce.core-ocre.gc.ca"
    }

  # aws_ses_domain_mail_from.custom_sending_domains["international.gc.ca"] will be created
  + resource "aws_ses_domain_mail_from" "custom_sending_domains" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "international.gc.ca"
      + id                     = (known after apply)
      + mail_from_domain       = "bounce.international.gc.ca"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic["core-ocre.gc.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_bounce_topic" {
      + id                       = (known after apply)
      + identity                 = "core-ocre.gc.ca"
      + include_original_headers = false
      + notification_type        = "Bounce"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic["international.gc.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_bounce_topic" {
      + id                       = (known after apply)
      + identity                 = "international.gc.ca"
      + include_original_headers = false
      + notification_type        = "Bounce"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic["core-ocre.gc.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_complaint_topic" {
      + id                       = (known after apply)
      + identity                 = "core-ocre.gc.ca"
      + include_original_headers = false
      + notification_type        = "Complaint"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic["international.gc.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_complaint_topic" {
      + id                       = (known after apply)
      + identity                 = "international.gc.ca"
      + include_original_headers = false
      + notification_type        = "Complaint"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic["core-ocre.gc.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_delivery_topic" {
      + id                       = (known after apply)
      + identity                 = "core-ocre.gc.ca"
      + include_original_headers = false
      + notification_type        = "Delivery"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic["international.gc.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_delivery_topic" {
      + id                       = (known after apply)
      + identity                 = "international.gc.ca"
      + include_original_headers = false
      + notification_type        = "Delivery"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ custom_sending_domains_dkim = [
      - {
          - domain = "notification.gov.bc.ca"
          - token  = "pypemga4ooemc3thf5h4p6jpcv5ieme2"
        },
      - {
          - domain = "notification.gov.bc.ca"
          - token  = "wp5wrojykc637go6gqaag7debuvk7suc"
        },
      - {
          - domain = "notification.gov.bc.ca"
          - token  = "om56oqvtknft7qeocs5offdcqcwvbpiu"
        },
      - {
          - domain = "notify.novascotia.ca"
          - token  = "r7e7juygsbrvjaj3ceuvpnjwksgi7vrs"
        },
      - {
          - domain = "notify.novascotia.ca"
          - token  = "3xxbqbyriwlz52t6wmydijkqtrwmikru"
        },
      - {
          - domain = "notify.novascotia.ca"
          - token  = "jit2blavxo37qnw3ekgn2ph4gazq3ufb"
        },
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
